{
  "character": {
    "imgur": "https://imgur.com/a/OXKFpVy",
    "id": "",
    "name": "Marth",
    "img": "https://imgur.com/S51TUSa",
    "img-profile": "https://imgur.com/KtaBB1B",
    "icon": "https://imgur.com/SGU9XMw",
    "thumbnail": ""
  },
  "move": {
    "name": "Down Tilt",
    "name-alt": "DTilt",
    "name-official": "Low Stab",
    "img-withoutHitbox": "https://imgur.com/VGS6KZm",
    "img-withHitbox": "https://imgur.com/xv4rASc",
    "img-all": {
      "withoutHitboxes": {
        "frame1": "",
        "frame2": ""
      },
      "withHitboxes": {
        "frame1": "",
        "frame2": ""
      }
    },
    "frameData": {
      "active": [7, 8, 9],
      "interruptible": 20,
      "recovery": 50
    },
    "stats-activeFrames": [
      {
        "damage": 9,
        "sd": 0,
        "bk": 40,
        "ks": 40,
        "angle": 30
      },
      {
        "damage": 8,
        "sd": 0,
        "bk": 25,
        "ks": 40,
        "angle": 30
      },
      {
        "damage": 8,
        "sd": 0,
        "bk": 20,
        "ks": 40,
        "angle": 30
      }
    ],
    "stats-tipper": {
      "damage": 10,
      "sd": 0,
      "bk": 50,
      "ks": 40,
      "angle": 30
    }
  },
  "dtil": {
    "subactionIndex": 59,
    "subactionName": "PlyMars5K_Share_ACTION_AttackLw3_figatree",
    "TotalFrames": 49,
    "interruptible": 20,
    "hitFrames": [
      {
        "start": 7,
        "end": 9,
        "hitboxes": [
          {
            "id": 0,
            "bone": 76,
            "damage": 9,
            "size": 3.9215686274509802,
            "x": 0.0,
            "y": 0.0,
            "z": 0.39215686274509803,
            "angle": 30,
            "krows": 40,
            "weightDepKb": 0,
            "hitboxInteraction": 3,
            "Kb": 40,
            "element": "slash",
            "shieldDamage": 0,
            "sfx": 35,
            "hitGrounded": true,
            "hitAirborne": true,
            "guide": 0,
            "groupId": 0
          },
          {
            "id": 1,
            "bone": 71,
            "damage": 8,
            "size": 2.7450980392156863,
            "x": 0.0,
            "y": 0.0,
            "z": 0.0,
            "angle": 30,
            "krows": 40,
            "weightDepKb": 0,
            "hitboxInteraction": 3,
            "Kb": 25,
            "element": "slash",
            "shieldDamage": 0,
            "sfx": 35,
            "hitGrounded": true,
            "hitAirborne": true,
            "guide": 1,
            "groupId": 1
          },
          {
            "id": 2,
            "bone": 25,
            "damage": 8,
            "size": 3.0588235294117645,
            "x": 0.0,
            "y": 0.0,
            "z": 0.0,
            "angle": 30,
            "krows": 40,
            "weightDepKb": 0,
            "hitboxInteraction": 3,
            "Kb": 20,
            "element": "slash",
            "shieldDamage": 0,
            "sfx": 3,
            "hitGrounded": true,
            "hitAirborne": true,
            "guide": 2,
            "groupId": 2
          },
          {
            "id": 3,
            "bone": 76,
            "damage": 10,
            "size": 3.9215686274509802,
            "x": 0.0,
            "y": 0.0,
            "z": 4.705882352941177,
            "angle": 30,
            "krows": 40,
            "weightDepKb": 0,
            "hitboxInteraction": 3,
            "Kb": 50,
            "element": "slash",
            "shieldDamage": 0,
            "sfx": 67,
            "hitGrounded": true,
            "hitAirborne": true,
            "guide": 3,
            "groupId": 3
          }
        ]
      }
    ]
  },
  "excerpts": {
    "ssbwiki": {
      "description": {
        "link": "https://www.ssbwiki.com/Marth_(SSBM)",
        "text": "A quick crouching Falchion poke. As it pokes out and is a semi-spike, it is very useful for edgeguarding, and is also a staple in Marth's neutral game as it can safely be used to interrupt dash-dancing and wavedashing approaches or follow-ups. It may lead into a grab follow-up below 100%. It also has the property of having a high amount of interruptibility frames. Because of this property Marth is unable to shield as quickly as if he were to do anything else such as dashing or performing smash attacks."
      },
      "overview": {
        "link": "https://www.ssbwiki.com/Marth_(SSBM)/Down_tilt",
        "text": "Marth does a quick crouching sword poke in front of himself. This move is Marth's safest tool to close in on opponents. Because of its early interruptibility and a long range with short startup, this move is hard to punish for most characters when spaced correctly. It is also useful for gimping the recoveries of certain characters, such as Fox and Falco, and can do so at early percentages after a down throw or neutral attack."
      }
    },
    "meleeguru": {
      "Down Tilt": {
        "link": "http://melee.guru/characters/marth-stage2.html",
        "text": "It's not a stretch to say that a large portion of Marth's overall strategy hinges on Dtilt. With a disjointed hit-box on frame 7, long range, and extremely low ending lag, Marth's Dtilt is undeniably one of the most powerful attacks in the entire game. Dtilt is used to approach, counter grounded options, and even pressure shields. Once you've established clearly the threat and pressure of Dtilt to your opponent, they must respect it. In an attempt to counter your Dtilts they are all but forced to start using aerial options. This is advantageous for you, since: You will be expecting it, Marth is more than capable of covering aerial approaches, and Marth's Punish game is brutal against aerial opponents."
      },
      "DTilt's IASA Frames": {
        "link": "http://melee.guru/characters/marth-stage2.html",
        "text": "The animation of Dtilt lasts 49 frames, with an active hit-box from frame 7 through 9. The 40 frames of animation after the hit-box is no longer active would normally leave you vulnerable. Luckily, Dtilt has what are known as 'Interruptible As Soon As Frames'. IASA Frames are frame windows during certain animations that you can use certain actions to interrupt, which cancels the remainder of the animation. In the case of Marth's Dtilt, the IASA Frames begin at frame 20. Meaning that you can cut the animation short as early as 20 frames into Dtilting. Cutting over half of the ending lag for one of your best attacks is invaluable, and is one of the most important and beneficial techniques for you to master early."
      },
      "taisMarthGuide": {
        "Dtilt": {
          "link": "http://www.meleeitonme.com/sharpening-your-sword-tais-marth-guide/",
          "text": [
            "This attack is absolutely fantastic. It comes out on frame 7, it’s interruptable from frame 20 --out of 49 frames total--, and it is one of Marth’s moves that does not have the problem of being a swinging, arcing hitbox, allowing it to be used like more of a persistent hitbox in one place, and that place happens to be in front of him, on the ground, which is an AMAZING place to have a fast, long-range, disjointed hitbox.",
            "I believe this is Marth’s most important asset in neutral. It’s because of this move that Marth has such great ground control, and his ground control is largely what makes him a great character in the first place.",
            "Dtilt is OP. However, one thing I must emphasize is that it’s only good if you use it intelligently!  It’s fairly punishable if you let the opponent jump over you or if you let them trade with your dtilt. Dtilt is very unlike other OP moves for this reason. It’s not a good move because it works pretty safely in a billion situations --e.g. Fox nair-- and it’s not a good move because it converts into big damage --e.g. Peach dsmash-- on-shield and/or on-hit. Dtilt is a good move because it opens so many doors for Marth, but it’s the responsibility of the player to follow up on them.  For example, if your opponent has resorted to jumping at you or trying to force a trade against you, then that gives you a lot of leverage to do… anything else. The rest of Marth’s kit is perfectly suited for evasion and anti-air, giving him plenty of tools to follow up on the threat of dtilt. I’d even go so far as to say that this move is what completes Marth as a character–what enables all of Marth’s other options to actually work.",
            "In addition to its strength in zoning, dtilt is also a very good edgeguarding tool. It’s much faster than his fsmash, making it easier to land and easier to follow-up afterwards, and its on-hit trajectory is pretty good for edgeguarding.",
            "A small little gimmick I have with dtilt is to immediately go in for a grab after hitting one. A lot of people will go defensive for a split second --shield, CC, or sometimes they’ll just get thrown off-guard-- after you use your dtilt to put them in time-out or they’ll try to close in on you immediately to try getting an advantage from your dtilt’s end-lag, allowing you to just go for a grab. Don’t rely on this 100% obviously, but it’s very nifty."
          ]
        }
      }
    }
  }
}
